{
    "definitions": [
        {
            "term": "UML",
            "synonym": "U M L",
            "synonym1": "Unified Modeling Language",
            "definition": "Die Unified Modeling Language dient zur Modellierung, Dokumentation, Spezialisierung und Visualisierung komplexer Systeme, unabhängig von deren Fach­ und Reali­sierungsgebiet. ",
            "definition1": "Sie liefert die Notationselemente gleichermaßen für die statischen und dynamischen Modelle von Analyse, Design und Architektur und unterstützt insbesondere objektorientierte Vorgehensweisen. "
        },
        {
            "term": "OMG",
            "synonym": "O M G",
            "synonym1": "Object Management Group",
            "definition": "Die Object Management Group ist ein 1989 gegründetes Konsortium, das sich mit der Entwicklung von Standards für die herstellerunabhängige systemübergreifende objektorientierte Programmierung beschäftigt. ",
            "definition1": "Die Object Management Group hat derzeit über 800 Mitglieder. Namhafte Unternehmen, wie Apple, Microsoft oder IBM, sind vertreten. Die O M G entwickelt zum Beispiel die U M L, C O R B A oder B P M N. "
        },
        {
            "term": "Diagrammtyp",
            "synonym": "Diagrammtypen",
            "synonym1": "",
            "definition": "Die Modellelemente der U M L werden nach Diagrammtypen gegliedert. Die U M L besitzt 14 Diagrammtypen. Jedem Diagrammtyp liegt eine bestimmte Betrachtungsweise eines Softwaresystems zu Grunde. ",
            "definition1": "Die einzelnen Diagramme lassen sich nach diesen Betrachtungsweisen in vier Bereiche gliedern: Requirements. Statische Sicht. Dynamische Sicht. Implementierung. "
        },
        {
            "term": "Sichten",
            "synonym": "",
            "synonym1": "",
            "definition": "Die U M L­ Spezifikation unterstützt bewusst ein Sichtenkonzept, das es ermöglicht, ein und dasselbe U M L­ Element, das genau einmal im Modell vorkommt, auf ganz unterschiedliche Weise für unterschiedliche Sichten und Lesergruppen mehrfach darzustellen. ",
            "definition1": ""
        },
        {
            "term": "Statische Sicht",
            "synonym": "Statik",
            "synonym1": "",
            "definition": "Die statische Sicht betrachtet den logischen Aufbau des Systems. Hierzu gehören das Klassendiagramm, das Paketdiagramm und das Kollaborationsdiagramm. ",
            "definition1": ""
        },
        {
            "term": "Dynamische Sicht",
            "synonym": "Dynamik",
            "synonym1": "",
            "definition": "Die dynamische Sicht bringt Interaktionen und Abläufe des Systems in Verbindung. Hierzu gehören das Aktivitätsdiagramm, das Paketdiagramm und das Kollaborationsdiagramm. ",
            "definition1": ""
        },
        {
            "term": "Laufzeitschicht",
            "synonym": "",
            "synonym1": "",
            "definition": "Die Laufzeitschicht ist die unterste Schicht und stellt die Realität dar. Sie beschreibt die reale Basis von Modellen, oder umgekehrt: aus ihr werden Modelle erstellt. ",
            "definition1": ""
        },
        {
            "term": "Modellschicht",
            "synonym": "model layer",
            "synonym1": "",
            "definition": "Die Realität aus der untersten Schicht der Laufzeitschicht wird in der Modellschicht bewusst abstrahiert. Das heißt, sich auf das Wesentliche zu konzentrieren. ",
            "definition1": "Ein Beispiel für die Bildung eines Modells ist die Klasse Auto im Klassendiagramm mit entsprechenden Attributen und Assoziationen. "
        },
        {
            "term": "Meta Modellschicht",
            "synonym": "Metamodellschicht",
            "synonym1": "Metamodell",
            "definition": "Ein Modell, das ein Modell beschreibt. Das Metamodell gibt die Regeln für das Modell aus der Modellschicht vor. ",
            "definition1": "Das Metamodell beschreibt zum Beispiel, dass Klassen beliebig viele Attribute und Operationen haben dürfen. "
        },
        {
            "term": "Meta-Metamodellschicht",
            "synonym": "Meta Meta Modellschicht",
            "synonym1": "meta meta model layer",
            "definition": "Die Meta-Metamodellschicht ist die oberste Eben im 4-Schichten Modell der U M L. Es ist die Grundlage der Metamodellebenen. ",
            "definition1": "Diese Schicht beschreibt, welche Elemente ein technisch Belesener einem Metamodell hinzufügen darf. "
        },
        {
            "term": "Strukturdiagramme",
            "synonym": "Strukturdiagramm",
            "synonym1": "structure diagram",
            "definition": "Die erste große Gruppe bilden die Strukturdiagramme. Sie bilden die statischen Strukturaspekte eines Systems ab. Die U M L stellt zur Strukturmodellierung sieben Diagrammtypen bereit. ",
            "definition1": "Zu den Strukturdiagrammen gehören: Klassendiagramm. Paketdiagramm. Objektdiagramm. Kompositionsstrukturdiagramm. Komponentendiagramm. Verteilungsdiagramm. Profildiagramm. "
        },
        {
            "term": "Verhaltensdiagramme",
            "synonym": "Verhaltensdiagramm",
            "synonym1": "behaviour diagram",
            "definition": "Die zweite große Gruppe bilden die Verhaltensdiagramme. Sie bilden dynamische Situationen im Programmablauf ab. Die U M L stellt zur Verhaltensmodellierung sieben Diagrammtypen bereit, welche verschiedene Sichten auf das zu spezifizierende Verhalten legen. ",
            "definition1": "Zu den Verhaltensdiagrammen gehören Use­ Case­ Diagramm. Aktivitätsdiagramm. Zustandsautomat sowie alle Interaktionsdiagramme. "
        },
        {
            "term": "Interaktionsdiagramme",
            "synonym": "Interaktionsdiagramm",
            "synonym1": "interaction diagram",
            "definition": "Interaktionsdiagramme dienen dazu, Interaktionen zwischen Objekten zu spezifizieren beziehungsweise zu illustrieren. Eine Interaktion ist dabei eine Folge von Operationsaufrufen innerhalb einer bestimmten Gruppierung von Objekten. Von den sieben Verhaltensdiagrammen ordnet man vier Diagramme den Interaktionsdiagrammen zu. ",
            "definition1": " Zu den Interaktionsdiagrammen gehören das Sequenzdiagramm. Kommunikationsdiagramm. Timingdiagramm. und Interaktionsübersichtsdiagramm. "
        },
        {
            "term": "Profildiagramme",
            "synonym": "Profildiagramm",
            "synonym1": "profile diagram",
            "definition": "Das Profildiagramm ist ein Diagrammtyp, der nicht in der operativen Phase der Erstellung von Modellen eingesetzt wird. Mit dem Profildiagramm werden die für ein Projekt benötigten Anpassungen dokumentiert. ",
            "definition1": "So entsteht ein porjektspezifisches Profil. "
        },
        {
            "term": "Klassendiagramme",
            "synonym": "Klassendiagramm",
            "synonym1": "class diagram",
            "definition": "Zentrale Frage des Klassendiagramms ist es, herauszufinden, aus welchen Klassen das zu entwickelnde System besteht und wie diese untereinander in Beziehung stehen werden. ",
            "definition1": "Das Klassendiagramm beschreibt die statische Struktur des zu entwerfenden Systems. Es enthält alle relevanten Strukturzusammenhänge und Datentypen und bildet die Brücke zu den dynamischen Diagrammen. "
        },
        {
            "term": "Kompositionsstrukturdiagramme",
            "synonym": "Kompositionsstrukturdiagramm",
            "synonym1": "composite structure diagram",
            "definition": "Zentrale Frage des Kompositionsstrukturdiagramms ist es, herauszufinden, wie das Innenleben einer Klasse, einer Komponente, eines Systemteils aussieht. Es ist ideal zur Top-Down-Modellierung. ",
            "definition1": "Das Kompositionsstrukturdiagramm fordert mittlere Detailtiefe, denn es zeigt Teile eines Gesamtelements und deren Mengenverhältnisse. "
        },
        {
            "term": "Komponentendiagramme",
            "synonym": "Komponentendiagramm",
            "synonym1": "component diagram",
            "definition": "Zentrale Frage des Komponentendiagramms ist es, herauszufinden, wie Klassen zu wiederverwendbaren, verwaltbaren Komponenten zusammengefasst werden und wie diese in Beziehung stehen. ",
            "definition1": "Das Komponentendiagramm zeigt die Organisation und Abhängigkeiten einzelner technischer Systemkomponenten. Eine Modellierung angebotener und benötigter Schnittstellen ist möglich. "
        },
        {
            "term": "Verteilungsdiagramme",
            "synonym": "Verteilungsdiagramm",
            "synonym1": "deployment diagram",
            "definition": "Zentrale Frage des Verteilungsdiagramms ist es, herauszufinden, wie das Einsatzumfeld, also Hardware, Software oder Datenbanken, des Systems aussieht. Die Frage, wie die Komponenten zur Laufzeit wohin verteilt werden, wird beantwortet. ",
            "definition1": "Das Verteilungsdiagramm teift das Laufzeitumfeld des Systems mit den greifbaren Systemteilen. Es fordert ein hohes Abstraktionsniveau."
        },
        {
            "term": "Objektdiagramme",
            "synonym": "Objektdiagramm",
            "synonym1": "object diagram",
            "definition": "Zentrale Frage des Objektdiagramms ist es, herauszufinden, welche innere Struktur das System zu einem bestimmten Zeitpunkt zur Laufzeit besitzt. ",
            "definition1": "Das Objektdiagramm zeigt Objekte und deren Attributsbelegungen zu einem bestimten Zeitpunkt. Es wird nur beispielhaft zur Veranschaulichung verwendet. "
        },
        {
            "term": "Paketdiagramme",
            "synonym": "Paketdiagramm",
            "synonym1": "package diagram",
            "definition": "Zentrale Frage des Paketdiagramms ist es, herauszufinden, wie das Modell so geschnitten werden kann, dass der Überblick bewahrt wird. ",
            "definition1": "Das Paketdiagramm organisiert das Systemmodell in größere Einheiten durch logische Zusammenfassung von Modellelementen. Es werden Abhängigkeiten modelliert.   "
        },
        {
            "term": "Sequenzdiagramme",
            "synonym": "Sequenzdiagramm",
            "synonym1": "sequence diagram",
            "definition": "Zentrale Frage des Sequenzdiagramms ist es, herauszufinden, wer mit wem welche Informationen in welcher Reihenfolge austauscht. ",
            "definition1": "Das Sequenzdiagramm stellt den zeitlichen Ablauf des Informationsaustausches zwischen Kommunikationspartner dar. Schachtelungen und Flusssteuerung sind möglich. "
        },
        {
            "term": "Kommunikationsdiagramme",
            "synonym": "Kommunikationsdiagramm",
            "synonym1": "communication diagram",
            "definition": "Zentrale Frage des Kommunikationsdiagramms ist es, herauszufinden, wer mit wem kommuniziert. Die Frage, wer im System zusammenarbeitet, wird beantwortet. ",
            "definition1": "Das Kommunikationsdiagramm  stellt den Informationsaustausch zwischen Kommunikationspartnern dar. Der Überblick steht hierbei im Vordergrund. "
        },
        {
            "term": "Interaktionsübersichtsdiagramme",
            "synonym": "Interaktionsübersichtsdiagramm",
            "synonym1": "interaction overview diagram",
            "definition": "Zentrale Frage des Interaktionsübersichtsdiagramms ist es, herauszufinden, wann welche Interaktion abläuft. ",
            "definition1": "Das Interaktionsübersichtsdiagramm verbindet und strukturiert Interaktionsdiagramme auf Top Level Ebene. Es fordert ein hohes Abstraktionsniveau. "
        },
        {
            "term": "Zeitverlaufdiagramme",
            "synonym": "Zeitverlaufdiagramm",
            "synonym1": "timing diagram",
            "definition": "Zentrale Frage des Zeitverlaufdiagramms ist es, herauszufinden, wann sich verschiedene Interaktionspartner in welchem Zustand befinden. ",
            "definition1": "Das Zeitverlaufsdiagramm visualisiert das exakte zeitliche Verhalten von Klassen, Schnittstellen und so weiter. Es ist geeignet für Detailbetrachtungen, bei denen es wichtig ist, dass ein Ereignis zum richtigen Zeitpunkt eintritt. "
        },
        {
            "term": "Aktivitätsdiagramme",
            "synonym": "Aktivitätsdiagramm",
            "synonym1": "activity diagram",
            "definition": "Zentrale Frage des Aktivitätsdiagramms ist es, herauszufinden, wie ein betimmter flussorientierter Prozess oder ein Algorithmmus abläuft. ",
            "definition1": "Das Aktivitätsdiagramm visualisiert sehr detailliert Abläufe mit Bedingungen, Schleifen und Verzweigungen. Eine Parallelisierung und Synchronisation ist möglich. "
        },
        {
            "term": "Anwendungsfalldiagramme",
            "synonym": "Anwendungsfalldiagramm",
            "synonym1": "Use Case Diagramm",
            "definition": "Zentrale Frage des Anwendungsfalldiagramms ist es, herauszufinden, was ein System für seine Umwelt, wie Nachbarsysteme, Stakeholder, leistet. ",
            "definition1": "Das Anwendungsfalldiagramm präsentiert die Außensicht auf das System. Es ist zur Kontextabgrenzung geeignet und fordert ein hohes Abstraktionsniveau mit einfachen Notationselementen. "
        },
        {
            "term": "Zustandsdiagramme",
            "synonym": "Zustandsdiagramme",
            "synonym1": "state machine diagram",
            "definition": "Zentrale Frage des Zustandsdiagramms ist es, herauszufinden, welche Zustände ein Objekt, eine Schnittstelle, ein Use Case bei welchen Ereignissen annehmen kann. ",
            "definition1": "Das Zustandsdiagramm ist eine präzise Abbildung eines Zustandsmodells mit Zuständen, Ereignissen, Nebenläufigkeiten, Bedingungen, Eintrittsaktionen sowie Austrittsaktionen. "
        },
        {
            "term": "Rahmen",
            "synonym": "frame",
            "synonym1": "",
            "definition": "Optional und für bestimmte Fälle sieht die U M L einen Rahmen, auch Frame genannt, vor, der bestimmte Modellelemente umschließt. ",
            "definition1": "Dabei muss mindestens ein Name für die dargestellten Inhalte im Rahmenkopf, einem Fünfeck im Rahmen, stehen. Daneben können optional der Typ und zusätzliche Parameter eingetragen werden. "
        },
        {
            "term": "Rahmenkopf",
            "synonym": "heading",
            "synonym1": "",
            "definition": "Der Rahmenkopf, auch Heading genannt, ist ein eingezeichnetes Fünfeck im meist linken oberen Eck des Rahmens. ",
            "definition1": "Im Rahmenkopf können optional der Typ und zusätzliche Parameter eingetragen werden. Typen sind class, package, component, deployment, use case, activity, state machine und interaction. "
        },
        {
            "term": "Modell",
            "synonym": "model",
            "synonym1": "Modelle",
            "definition": "Eigenschaften eines Modells sind: Ein Modell versammelt eine hierarchisch strukturierte Menge von Elementen. Die Menge von Elementen beschreibt auf einer abstrakten Ebene das System zu einem bestimmten Zweck, es zeigt nur eine Sicht auf das System. Das Modell beschreibt das System aus dieser Sicht vollständig. ",
            "definition1": "A model captures a view of a system. It is an abstraction of the system, with a certain pur­pose. This purpose determines what is to be included in the model and what is irrelevant. Thus the model completely describes those aspects of the system that are relevant to the purpose of the model, at the appropriate level of detail. "
        },
        {
            "term": "Kommentar",
            "synonym": "comment",
            "synonym1": "Kommentare",
            "definition": "Mit Hilfe eines Kommentars können beliebige Informationen, die relevant erscheinen, an ein Modellelement angebracht werden. Ein Kommentar wird durch ein Rechteck mit umgeknickter rechter oberer Ecke repräsentiert. Der Kommentartext selbst befindet sich innerhalb des Rechtecks. Der Kommentar ist durch eine gestrichelte Linie mit dem annotierten Element verbunden. Diese Linie kann auch weggelassen werden, wenn die Verbindung mit dem Element aus dem Zusammenhang klar ersichtlich ist. ",
            "definition1": "A comment is a textual annotation that can be attached to a set of elements. "
        },
        {
            "term": "Ausdruck",
            "synonym": "expression",
            "synonym1": "Ausdrücke",
            "definition": "Formal stellt ein Ausdruck, in Englisch: expression, einen Knoten in einem Baum mit Ausdrücken dar, der durch ein Symbol repräsentiert wird. ",
            "definition1": "An expression is a structured tree of symbols that denotes a set of values when evaluated in a context. "
        },
        {
            "term": "Randbedingung",
            "synonym": "constraint",
            "synonym1": "Randbedingungen",
            "definition": "Eine Randbedingung, zu Englisch Constraint genannt, ist immer ein boolescher Ausdruck, der zur Präzisierung der Semantik eines oder mehrerer Modellelemente dient. ",
            "definition1": "A constraint is a condition or restriction expressed in natural language text or in a machine readable language for the purpose of declaring some of the semantics of an element. "
        },
        {
            "term": "Classifier",
            "synonym": "classifier",
            "synonym1": "",
            "definition": "Der Classifier ist kein Sprachelement, welches dem Modellierer direkt in einem U M L­ Diagramm zur Modellierung zur Verfügung steht, sondern der Classifier ist eine abstrakte Metaklasse, deren Instanzen modelliert werden. Die Notation eines Classifier ist ein einfaches Rechteck mit dem Namen des Classifier. ",
            "definition1": "A classifier is a classification of instances, it describes a set of instances that have features in common. "
        },
        {
            "term": "Datentyp",
            "synonym": "datatype",
            "synonym1": "Datentypen",
            "definition": "In der U M L wird ein Datentyp verwendet, um mögliche Wertebereiche einzu­grenzen. Die U M L definiert einige wenige Typen, wie der Aufzählungstyp, auch Enumeration genannt, sowie der Primitive Typ mit seinen Subtypen. ",
            "definition1": "Ein Datentyp wird durch das Rechteckssymbol mit dem ihn identifizierenden Schlüsselwort notiert, also datatype für einen Datentyp, enumeration oder primitive für die spe­ziellen Datentypen Primitiver Typ und Aufzählungstyp. "
        },
        {
            "term": "Primitiver Datentyp",
            "synonym": "primitive type",
            "synonym1": "Primitive Datentypen",
            "definition": "Ein primitiver Typ ist insofern ein besonderer Datentyp, als dass er weder Attri­bute noch Operationen beziehungsweise allgemein keine Unterstruktur enthält. ",
            "definition1": "Typische Vertreter der primitiven Typen sind Zahlen, für die meist außerhalb der U M L bereits Regeln, das heißt eine Algebra, existieren. Beispiele sind der boolesche Typ, der Integer, der String und die natürlichen Zahlen. "
        },
        {
            "term": "Aufzählungstyp",
            "synonym": "enumeration",
            "synonym1": "Aufzählungstypen",
            "definition": "Aufzählungstypen sind spezielle Datentypen mit einer endlichen Menge benutzerdefinierter, diskreter Werte. Ein solcher Wert heißt Aufzählungswert und spezi­fiziert einen Wert, den ein Element mit dem Aufzählungstyp zur Laufzeit annehmen darf. ",
            "definition1": "Aufzählungstypen werden notiert wie Datentypen und mit dem Schlüsselwort: enumeration , gekennzeichnet. "
        },
        {
            "term": "Literal",
            "synonym": "literal",
            "synonym1": "Literale",
            "definition": "Buchstabensymbole oder Literale werden in der U M L verwandt, um Werte zu notie­ren. Die UML definiert sechs verschiedene Typen von Literalen, korrespondierend zu den Datentypen. Literale werden in Abhängigkeit der Werte beziehungsweise der Datentypen notiert, welche sie spezifizieren. ",
            "definition1": "Es gibt das Literal boolean integer, null, real, string und unlimited natural. "
        },
        {
            "term": "Klasse",
            "synonym": "Klassen",
            "synonym1": "Class",
            "definition": "Unter Klasse versteht die U M L eine Sammlung von Exemplaren, die über gemeinsame Eigen­schaften, Einschränkungen und Semantik verfügen. ",
            "definition1": "Eine Klasse wird durch ein Rechteck mit durchgezogener Linie dargestellt. Der Name der Klasse steht in Fettdruck und mittig innerhalb des Rechtecks. Der Klassenname wird großgeschrieben. "
        },
        {
            "term": "Abstrakte Klasse",
            "synonym": "Abstrakte Klassen",
            "synonym1": "abstract Class",
            "definition": "Oftmals ergibt sich der Bedarf, innerhalb der Modellierung Elemente einzuführen, die ledig­lich der Strukturierung und Vereinfachung dienen. Ein solches Element ist die abstrakte Klasse. ",
            "definition1": "Abstrakte Klassen sind nicht instanziierbar. Der Klassenname wird kursiv gesetzt oder es wird in geschweiften Klammern das Schlagwort: abstract hinzugefügt. "
        },
        {
            "term": "Compartments",
            "synonym": "compartment",
            "synonym1": "",
            "definition": "Compartments oder auch Abschnitte können unterhalb des Klassennamens angefügt werden, um zum Beispiel Attribute und Operationen zu definieren. ",
            "definition1": ""
        },
        {
            "term": "Objekt",
            "synonym": "Objekte",
            "synonym1": "object",
            "definition": "Im Rahmen der U M L wird eine Klasse als Typ interpretiert, dessen Ausprägungen Objekte heißen. ",
            "definition1": "Für die U M L ist ein Objekt nichts anderes als die Ausprägung einer Klasse. Die Klasse ist der Typ eines Objekts. Objektnamen werden unterstrichen. "
        },
        {
            "term": "Attribut",
            "synonym": "property",
            "synonym1": "Eigenschaft",
            "definition": "Ein Klassendiagramm enthält nicht nur Aussagen über die Existenz von Klassen, sondern gibt auch Auskunft über die einzelnen Eigenschaften, die bei den konkret betrachte­ten Exemplaren der Klasse mit konkreten Inhaltswerten belegt werden. Diese Eigenschaften werden als Attribute bezeichnet und beschreiben Charakteristika wie Häufigkeit, Datentyp und weitere Einschränkungen. ",
            "definition1": "Attribute werden üblicherweise im zweiten Abschnitt des Klassensymbols linksbündig untereinander angeordnet. Attributnamen werden kleingeschrieben und Klassenattribute unterstrichen. Ein Plus vor einem Attribut bedeutet public, ein Minus private, ein Doppelkreuz protected und ein Tilde package scoped. "
        },
        {
            "term": "Operation",
            "synonym": "Operationen",
            "synonym1": "operation",
            "definition": "Die Klassenmodellierung schlägt die Brücke zur dynamischen Betrachtung des Systems, indem sie die auf den Objekten ausgeführten Operationen beziehungsweise Methoden berücksichtigt. Jede Klasse kann wahlfrei Operationen definieren. Im Verlauf der Implementierung können die einer Operation zugeordneten Methoden ein bestimmtes Verhalten auslösen. ",
            "definition1": "Eine Operation wird immer durch mindestens ihren Namen sowie weitere Angaben spezi­fiziert. Mehrere Operationen werden dabei vertikal untereinander linksbündig typischer­weise im dritten Abschnitt des Klassensymbols angeschrieben. Abstrakte Operationen sind kursiv gesetzt. Klassenoperationen werden unterstrichen. Der Name der Operation wir im Allgemeinen klein gesetzt. "
        },
        {
            "term": "Schnittstelle",
            "synonym": "interface",
            "synonym1": "Interface",
            "definition": "Eine Schnittstelle oder Interface genannt, beschreibt eine Menge von öffentlichen Operationen, Merk­malen und Verpflichtungen, die durch einen Classifier, der die Schnittstelle implementiert, zwingend bereitgestellt werden müssen. ",
            "definition1": "In der Standardnotation wird die Schnittstelle mit einem Klassensymbol dargestellt, das mit dem Schlüsselwort interface versehen ist. "
        },
        {
            "term": "Socket",
            "synonym": "Ball",
            "synonym1": "",
            "definition": "Ein großes, nicht ausgefülltes Kreissymbol kennzeichnet, dass ein Element eine gegebene Schnittstelle implementiert. Dies nennt sich Ball. ",
            "definition1": "Ein durch das Halbkreissymbol, auch Socket genannt, gekennzeichnetes Element kennzeichnet die Notwendigkeit einer Schnittstelle. "
        },
        {
            "term": "Generalisierung",
            "synonym": "generalization",
            "synonym1": "Generalisation",
            "definition": "Eine Generalisierung in der U M L ist eine gerichtete Beziehung zwischen einem speziellen und einem generellen Classifier. Instanzen des speziellen Classifiers sind damit auch Instanzen des generellen Classifiers. Konkret bedeutet dies, dass der spezielle Classifier implizit über alle Merkmale des generellen Classifiers verfügt. ",
            "definition1": "Die Generalisierungsbeziehung zwischen Classifiern wird mit einem Pfeil mit nicht ausge­füllter dreieckiger Pfeilspitze dargestellt. Er zeigt vom spezialisierten Classifier hin zum allgemeinen oder generalisierten Classifier. "
        },
        {
            "term": "Assoziation",
            "synonym": "association",
            "synonym1": "Assoziationen",
            "definition": "Eine Assoziation beschreibt eine Beziehung zwischen zwei oder mehr Classifiern, im häufigsten Fall eine Verbindung zwischen genau zwei Klassen. Assoziationen definieren dabei eine Beziehung auf Typebene. Auf Instanzebene nennen sich die konkreten Ausprägungen einer Assoziation Link. ",
            "definition1": "Die binäre Assoziation wird durch eine durchgezogene Linie dargestellt, die die teilnehmenden Classifier - meist Klassen oder Objekte verbindet. Die wichtigsten Angaben einer Assoziation sind ihr Name und die Beschriftung der Enden mit deren Namen und der Multiplizität. "
        },
        {
            "term": "Assoziationsklasse",
            "synonym": "association class",
            "synonym1": "Assoziationsklassen",
            "definition": "Assoziationsklassen werden in Analysephasen von Prozessmodellen verwendet und später zum Entwurf aufgelöst. Dazu werden entweder die Attribute auf die Klassen der Assoziation verteilt, oder die Assoziation wird aufgeteilt, indem die Assoziationsklasse als eigenständige Klasse eingefügt wird. ",
            "definition1": "Ein Beispiel ist die Auflösung der Assoziationsklasse Ausleihe in der Beziehung zwischen Leser und Buch zur Klasse Ausleihe mit entsprechenden Multiplizitäten. "
        },
        {
            "term": "Aggregation",
            "synonym": "Aggregationen",
            "synonym1": "aggregation",
            "definition": "Eine Aggregation drückt eine Teile-­Ganzes­-Beziehung aus. Die aggregierten Instanzen einer Klasse sind dabei Teil eines Ganzen, das durch die Klasse am anderen Beziehungsende repräsentiert wird. In Java ist die Aggregation der Normalfall. In C++ wird die Aggregation durch die Verwendung eines Zeigers implementiert. ",
            "definition1": "Eine ungefüllte Raute an einem Ende der Assoziation wird als Aggregation bezeichnet und drückt aus, dass Objekte der Klasse B zu Objekten der Klasse A gehören, B-Objekte aber auch allein existieren können. "
        },
        {
            "term": "Komposition",
            "synonym": "composition",
            "synonym1": "composite aggregation",
            "definition": "Die Komposition als Sonderfall der Aggregation beschreibt die Beziehung zwischen einem Ganzen und seinen Teilen. Der Unterschied zur Aggregation ist, dass die Existenz eines Objekts, das Teil eines Ganzen ist, von der Existenz des Ganzen abhängig ist. Die Komposition kann in Java nicht direkt abgebildet werden. In C++ ist die Abbildung einer Komposition bei Attributen der Normalfall. ",
            "definition1": "Eine Komposition beschreibt einen azyklischen gerichteten Graph. Die ausgefüllte Raute am Ende der Assoziation verbildlicht die Komposition. Die Raute befindet sich dabei auf der Seite des dominierenden Elements. "
        },
        {
            "term": "Abhängigkeit",
            "synonym": "dependency",
            "synonym1": "Abhängigkeitsbeziehung",
            "definition": "Eine Abhängigkeitsbeziehung in der U M L ist eine gerichtete Beziehung zwischen einem abhängigen und einem unabhängigen Element. ",
            "definition1": "Eine Abhängigkeitsbeziehung wird in der U M L durch einen gestrichelten Pfeil dargestellt. Der Pfeil zeigt vom abhängigen auf das unabhängige Modellelement. "
        },
        {
            "term": "Verwendung",
            "synonym": "usage",
            "synonym1": "Verwendungsbeziehung",
            "definition": "Die Verwendungsbeziehung gibt an, dass das abhängige Element das unabhängige Element benutzt. ",
            "definition1": "Eine Verwendungsbeziehung wird mit dem Schlüsselwort use dekoriert. "
        },
        {
            "term": "Abstraktion",
            "synonym": "abstraction",
            "synonym1": "Abstraktionsbeziehung",
            "definition": "Falls ein Element eine Abstraktion eines anderen Elements darstellt, kann zwischen den beiden eine Abstraktionsbeziehung modelliert werden. ",
            "definition1": "Im allgemeinen Fall ist eine Abstraktionsbeziehung am Schlüsselwort abstract erkennbar. Es werden die Schlüsselwörter derive, trace und refine für besondere Formen der Abstraktion verwendet. "
        },
        {
            "term": "Substitution",
            "synonym": "Substitutionsbeziehung",
            "synonym1": "substitution",
            "definition": "Eine Substitutionbeziehung wird als Abstraktionsbeziehung mit dem Schlüsselwort sub­stitute modelliert. Im Gegensatz zu anderen Abstraktionsbeziehungen können Sie hier nur Classifier, also zum Beispiel Klassen, Komponenten oder Use ­Cases verbinden. ",
            "definition1": "Bei der Substiutionsbeziehung weist die Richtung des Pfeils auf das Element, das ersetzt wird. "
        },
        {
            "term": "Realisierung",
            "synonym": "realization",
            "synonym1": "Realisierungsbeziehung",
            "definition": "Bei der Realisierungsbeziehung steht das unabhängige Element für eine Spezifikation und das abhängige für eine Realisierung derselben. Oft modelliert diese Beziehung, dass eine Klasse eine Schnittstelle implementiert. Das ist ein Muster, das in Modellen für objektorientierte Software häufig vorkommt. ",
            "definition1": "Obwohl es sich bei der Realisierungsbeziehung um eine spezielle Form der Abstraktions­beziehung handelt, wird sie anders notiert. Statt mit einer offenen Pfeilspitze wird die Realisierung­ durch ein geschlossenes Dreieck am Ende der gestrichelten Linie gekennzeichnet. "
        },
        {
            "term": "Vererbung",
            "synonym": "inheritance",
            "synonym1": "Vererbungsbeziehung",
            "definition": "Eine Vererbungsbeziehung spielt sich rein auf der Klassenebene ab und ist dementsprechend im Objektdiagramm nicht sichtbar. Dies unterscheidet Vererbungen von Assoziationen, die sehr wohl in Objektdiagrammen zu sehen sind. ",
            "definition1": "Eine Vererbungsbeziehung wird durch eine Linie, die am Ende eine ungefüllte, recht breite Pfeilspitze besitzt, dargestellt. Diese Art der Verbindung darf nicht mit der gerichteten Assoziation verwechselt werden, bei der gefüllte, schmale Pfeilspitzen verwendet werden. "
        },
        {
            "term": "Informationsfluss",
            "synonym": "information flow",
            "synonym1": "Informationsflüsse",
            "definition": "Ein Informationsfluss spezifiziert, dass Informationselemente von ihren Quellen zu ihren Zielen zirkulieren. Der Informationfluss benötigt einen Informationskanal, über den die Elemente übertragen werden. ",
            "definition1": "Ein Informationsfluss wird als Abhängigkeitsbeziehung mit dem Schlüsselwort flow notiert. Der Pfeil zeigt von der Quelle zum Ziel der Informationsübertragung. "
        },
        {
            "term": "Informationseinheit",
            "synonym": "information item",
            "synonym1": "Informationseinheiten",
            "definition": "Eine Informationseinheit ist eine Abstraktion aller Arten von Informationen, die zwischen Objekten getauscht werden können. Die Informationseinheit ist eine Art Classifier, der die Information auf einem sehr abstrakten Niveau repräsentiert. ",
            "definition1": "Eine Informationseinheit wird entweder mit einem schwarzen Dreieck in der oberen rechten Ecke oder alternativ als Classifier mit dem Schlüsselwort information gekennzeichnet. "
        },
        {
            "term": "Multiplizität",
            "synonym": "Multiplizitäten",
            "synonym1": "multiplicity",
            "definition": "Multiplizität bezeichnet ein Intervall von nicht-negativen, ganzen Zahlen in der U M L. Das Intervall ist durch eine untere und eine obere Grenze bestimmt. Für ein Modellelement der U M L, das eine Multiplizität hat, gilt meistens, dass es eine Anzahl Werte oder Objekte halten kann. ",
            "definition1": "Elemente wie das Attribut, der Parameter, die Assoziationen oder der Pin haben eine Multiplizität. Bei den ersten beiden wird die Multiplizität in eckigen Klammern hinter dem Namen bzw. Typ angegeben. "
        },
        {
            "term": "Kardinalität",
            "synonym": "Kardinalitäten",
            "synonym1": "cardinality",
            "definition": "Kardinalitäten sind Mengenangaben, mit denen in der Datenmodellierung für jeden Beziehungstyp festgelegt wird, wie viele Entitäten eines Entitätstyps mit genau einer Entität des anderen am Beziehungstyp beteiligten Entitätstyps und umgekehrt in Beziehung stehen können oder müssen. ",
            "definition1": "Ein Beispiel: Mitarbeiter arbeitet in Abteilung. Jeder Mitarbeiter arbeitet in genau einer Abteilung; in jeder Abteilung können N Mitarbeiter arbeiten. Die Kardinalität ist hier also N Doppelpunkt Eins. Weitere gängige Kardinalitäten sind Eins zu Eins sowie N zu M Beziehungen. "
        },
        {
            "term": "Instanzbeschreibung",
            "synonym": "instance specification",
            "synonym1": "Instanzbeschreibungen",
            "definition": "Eine Instanz, präziser eine Instanzbeschreibung, beschreibt eine zur Laufzeit vorhanden Einheit des modellierten Systems. In vielen Fällen handelt es sich bei Instanzbeschreibungen um Objekte, also Instanzen von Klassen. ",
            "definition1": "Für Instanzbeschreibungen sieht die UML kein eigenes Notationselement vor, sondern übernimmt die Notation des Classifiers der Instanz. "
        },
        {
            "term": "Wertangabe",
            "synonym": "Slot",
            "synonym1": "Wertangaben",
            "definition": "Im Objektdiagramm ist es möglich, Werte von Strukturelementen einer Instanz zu einem bestimmten Zeitpunkt zu modellieren. Es handelt sich hierbei beispielsweise um Werte von Attributen einer Klasse. ",
            "definition1": "Ein Wert wird typischerweise in einer Instanzbeschreibung durch ein Gleichheitszeichen abgetrennt nach dem Namen des Attributs notiert. Auch die Notation über einen Link ist möglich. "
        },
        {
            "term": "Link",
            "synonym": "link",
            "synonym1": "",
            "definition": "Der Link stellt eine Instanz der Assoziation dar. Links sind also Beziehungen in Objektdiagrammen, die aus den Assoziationen der Klassendiagrammen hergeleitet werden. ",
            "definition1": "Ein Link übernimmt weitestgehend die Notation der Assoziation. "
        },
        {
            "term": "Instanz",
            "synonym": "Instance",
            "synonym1": "Instanzen",
            "definition": "Die U M L kennt im Wesentlichen drei Arten von Instanzen. Das Objekt als Instanz einer Klasse, den Link als Instanz einer Assoziation und den Wert eines Attributs oder einfachen Objekts. ",
            "definition1": ""
        },
        {
            "term": "Paket",
            "synonym": "package",
            "synonym1": "Pakete",
            "definition": "Ein Paket fasst mehrere paketierbare Elemente - meist Classifier - zu einer größe­ren Einheit zusammen. Beachten, dass jedes paketierbare Element nur in einem - oder keinem - Paket enthalten sein darf. ",
            "definition1": "Ein Paket wird durch ein Rechteck dargestellt, das den Bezeichner auf der Lasche oben links trägt. Innerhalb des Rechtecks werden die zugehörigen Elemente eingetragen. Jedem Element kann eine Sicht­barkeit mitgegeben werden. "
        },
        {
            "term": "Paket Import",
            "synonym": "Paketimport",
            "synonym1": "package import",
            "definition": "Ein Paket­-Import wird durch eine gerichtete Beziehung zwischen zwei Paketen definiert. Ein Quellpaket möchte Zugriff auf die Elemente eines anderen Pakets, des Zielpakets, besitzen. ",
            "definition1": "Ein Paket-Import wird durch einen gestrichelten Pfeil dargestellt. Das Schlüsselwort oberhalb des Pfeils macht diesen als Importpfeil kenntlich. Verwende import für einen public import, access für einen privaten import."
        },
        {
            "term": "Element Import",
            "synonym": "element import",
            "synonym1": "Elementimport",
            "definition": "Ein Element-Import identifiziert ein Element eines anderen Pakets, und erlaubt es, das Element mittels seines Namens statt seines Classifiers zu referenzieren. ",
            "definition1": "Ein Element-Import wird durch einen gestrichelten Pfeil dargestellt. Das Schlüsselwort oberhalb des Pfeils macht diesen als Importpfeil kenntlich. Verwende import für einen public import, access für einen privaten import."
        },
        {
            "term": "Paket Merge",
            "synonym": "package merge",
            "synonym1": "Paket-Merge",
            "definition": "Das Paket­-Merge stellt eine Erweiterung des Paket­-Imports dar. Während durch einen Import lediglich die entsprechenden Classifier verwendet werden dürfen, werden bei einem Paket­-Merge implizit neue, spezialisierte Classifier angelegt, die Sie dann verändern können. ",
            "definition1": "Ein Paket­-Merge wird durch eine Abhängigkeitsnotation und das Stereotyp merge dar­gestellt."
        },
        {
            "term": "Namensraum",
            "synonym": "namespace",
            "synonym1": "Namen Raum",
            "definition": "Ein Namensraum ist eine Sammelbox für beliebig viele benennbare Elemente. Innerhalb eines Namensraums müssen alle Elemente eindeutig durch ihren Namen identifizierbar sein. Beispiele für Namensräume sind Pakete, Klassen, Komponenten aber auch Zustände, Use­Cases und so weiter. ",
            "definition1": "Zwei Modellelemente in unterschiedlichen Namensräumen dürfen durchaus den gleichen Namen haben. Sie unterscheiden sich in diesem Fall in ihrem qualifizierten Namen. Der qualifizierte Name eines Modellelements besteht aus dem einfachen Namen, dem die Namen aller umschließenden Namensräume vorangestellt sind. Die einzelnen Segmente des qualifizierten Namens werden mit einem doppelten Doppelpunkt abgetrennt. "
        },
        {
            "term": "Komponente",
            "synonym": "component",
            "synonym1": "Komponenten",
            "definition": "Unter einer Komponente versteht man einen modularen Systemteil, der seinen Inhalt trans­parent kapselt und so vor dem Nutzer verbirgt. Jede Komponente selbst besteht aus darin eingeschlossenen Modellelementen, wie Klassen oder wiederum Komponenten, die gemeinsam eine klar definierte Funktionalität anbieten. Die Komponente ist nicht nur ein Datenlieferant, sondern eine eigenständige Anwendung. ",
            "definition1": "Komponenten werden durch ein mit dem Schlüsselwort component versehenes Klassensymbol dargestellt. Einheiten großer Systeme kannst du alternativ zu component auch mit dem Stereotyps sub System kennzeichnen. "
        },
        {
            "term": "Artefakt",
            "synonym": "artefact",
            "synonym1": "Artefakte",
            "definition": "Das Artefakt stellt eine physische Informationseinheit dar. Hierbei kann es sich um Mo­delle, Quellcode, Skripte, ausführbare Binärdateien, Tabellen innerhalb einer relationalen Datenbank, Dokumente einer Textverarbeitung, E­mails oder andere Dinge handeln, die im Softwareentwicklungsprozess oder zur Laufzeit eines Systems produziert oder konsumiert werden. ",
            "definition1": "Sinnvolle Stereotypen für Artefakte sind: file, document, executable, source, oder library. Ein Artefakt wird durch ein mit dem Schlüsselwort artifact versehenes Classifier-Symbol dargestellt. Zusätzlich wird in der rechten oberen Ecke ein stilisiertes Dokument symbolisch platziert. "
        },
        {
            "term": "Part",
            "synonym": "part",
            "synonym1": "Parts",
            "definition": "Parts sind Teile eines Classifiers, die bei dessen Instanziierung mit instanziiert werden und danach eine bestimmte Rolle einnehmen. Sie strukturieren den Classifier und stehen mit ihm in Kompositionsbeziehung. Parts können durch Attribute oder andere Classifier gebildet werden. ",
            "definition1": "Ein Part wird als Rechteck innerhalb eines ihn umgebenden struk­turierten Classifiers beziehungsweise einer Klasse gezeichnet."
        },
        {
            "term": "Konnektor",
            "synonym": "connector",
            "synonym1": "Konnektoren",
            "definition": "Ein Konnektor spezifiziert eine Kommunikationsverbindung zwischen sogenannten verbindbaren Elementen und damit insbesondere zwischen Parts und Parts, Parts und Ports, oder Ports und Ports beziehungsweise genauer zwischen deren Instanzen. Der Unterschied zu einer Assoziation liegt in der Definition und Anwendung von Parts begründet. ",
            "definition1": "Ein Konnektor wird ähnlich wie eine Assoziation als einfache durchgezogene Linie dargestellt. "
        },
        {
            "term": "Port",
            "synonym": "port",
            "synonym1": "Ports",
            "definition": "Ein Port ist ein Kommunikationspunkt zwischen einem Classifier beziehungsweise einer Klasse oder einem Part und seiner Außenwelt. ",
            "definition1": "Ein Port wird als kleines Quadrat notiert, das auf der Umrandung eines Classifiers beziehungsweise Parts angebracht ist. "
        },
        {
            "term": "Kollaboration",
            "synonym": "collaboration",
            "synonym1": "Kollaborationen",
            "definition": "Eine Kollaboration in der U M L ist ein Modellelement, das eine Sicht auf zusammenspie­lende Modellelemente darstellt. Diese arbeiten zusammen, um eine gemeinsame Aufgabe zu bewältigen. ",
            "definition1": "Eine Kollaboration wird durch eine gestrichelte Ellipse dargestellt, die durch eine weitere gestrichelte Linie in zwei Abschnitte geteilt wird. Im oberen Abschnitt wird der Name der Kollaboration angegeben. Im unteren Abschnitt werden dann die Modellelemente, die in diesem Kollaborationstypen zusammenarbeiten, mit Hilfe von Rollen und Konnektoren angeführt. "
        },
        {
            "term": "Kollaborationsanwendung",
            "synonym": "collaboration use",
            "synonym1": "",
            "definition": "Die Kollaborationsanwendung stellt die Anwendung des durch eine Kollaboration definierten Musters auf das Modell dar. Dadurch wird ersichtlich, welches Element welche Rolle spielt und damit seinen Beitrag zur Erfüllung der Gesamtaufgabe beiträgt. ",
            "definition1": "Die Anwendung einer Kollaboration wird als gestrichelte Ellipse mit folgender Bezeichnung dargestellt: Name der Kollaborationsanwendung, Doppelpunkt, Kollaboration. Auf die Elemente, die die jeweiligen Rollen der Kollaboration einnehmen, zeigen gestrichelte Pfeile, die in der Nähe des Elements mit dem Rollennamen versehen werden. "
        },
        {
            "term": "Knoten",
            "synonym": "node",
            "synonym1": "nodes",
            "definition": "Ein Knoten repräsentiert eine Ressource, die zum Beispiel zur Installation, Konfiguration, Bereitstellung und Ausführung von Artefakten genutzt werden kann. Knoten können geschachtelt werden. ",
            "definition1": "Ein Knoten wird mit dem Schlüs­selwort node dargestellt. "
        },
        {
            "term": "Gerät",
            "synonym": "device",
            "synonym1": "Geräte",
            "definition": "Ein Gerät ist eine physische Ressource mit eigener Rechenkapazität. Ein Gerät repräsentiert die Hardware im Verteilungsdiagramm. Artefakte werden auf Geräte verteilt, damit sie ausgeführt werden können. ",
            "definition1": "Ein Gerät wird als Knoten mit dem Schlüs­selwort: device dargestellt. "
        },
        {
            "term": "Ausführungsumgebung",
            "synonym": "execution environment",
            "synonym1": "Ausführungsumgebungen",
            "definition": "Eine Ausführungsumgebung ist eine Software -Umgebung, in der bestimmte Software­-Komponenten eines Systems ausgeführt werden können. Die Komponenten liegen dabei als ablauffähige Artefakte vor. ",
            "definition1": "Eine Ausführungsumgebung wird als Knoten mit dem Schlüs­selwort: Execution Environment dargestellt. "
        },
        {
            "term": "Kommunikationspfad",
            "synonym": "communication path",
            "synonym1": "Kommunikationspfade",
            "definition": "Durch Kommunikationspfade können Knoten sowohl auf Typ­ als auch auf Instanz­-Ebene miteinander verbunden werden, um Nachrichten, wie Signale oder Operationsaufrufe, auszutauschen. Kommunikationspfade ermöglichen die Modellierung komplexer Netzwerke. ",
            "definition1": "Ein Kommunikationspfad ist eine spezielle Art der Assoziation. Die Notation entspricht daher der für Assoziationen. "
        },
        {
            "term": "Verteilungsbeziehung",
            "synonym": "deployment",
            "synonym1": "Verteilungsbeziehungen",
            "definition": "Die Verteilungsbeziehung repräsentiert die Beziehung zwischen einem Artefakt und dem Knoten, auf den das Artefakt verteilt ist. Damit kann zum Beispiel ausgedrückt werden, welcher Teil des Systems auf welcher Ausführungsumgebung ablaufen soll. Im Allgemeinen werden diese Art von Beziehungen zwischen Artefakten und Knoten modelliert. ",
            "definition1": "Verteilungsbeziehungen werden als gestrichelter und gerichteter Pfeil mit dem Schlüsselwort deploy kenntlich gemacht. "
        },
        {
            "term": "Einsatzspezifikation",
            "synonym": "deployment specification",
            "synonym1": "Einsatz",
            "definition": "Eine Einsatzspezifikation ist eine spezielle Art eines Artefakts. Sie beinhaltet eine Menge von Parametern, die durch Angabe von Werten die Verteilung eines Artefakts auf Knoten regelt. Darüber hinaus können Sie Parameter wie beispielsweise Maximaldauer der Abarbeitung oder Art der Task­-Abarbeitung festlegen, um die Ausführung des Artefakts zu steuern. ",
            "definition1": "Eine Einsatzspezifikation wird mit dem Classifier ­Symbol und dem Schlüsselwort deploy­ment spec abgebildet. "
        },
        {
            "term": "Use-Case",
            "synonym": "Anwendungsfall",
            "synonym1": "use case",
            "definition": "Ein Use-­Case beschreibt eine Menge von Aktionen, die, schrittweise ausgeführt, ein spe­zielles Verhalten formen. Ein Use-­Case bildet eine Art Hülle, die auch Sonder­ und Fehlerfall-Aktionen einschließen kann. Ein Use-­Case wird stets von einem Akteur ausgelöst bzw. instanziiert und führt zu einem fachlichen Ergebnis. Die Bezeichnung des Use-­Case spiegelt die Sicht des Akteurs wider und nicht die des Systems. ",
            "definition1": "Es gibt viele Notationsmöglichkeiten für Use-Cases. Entscheide dich für eine und halten diese bei. In aller Regel wird ein Use-­Case durch eine Ellipse dargestellt. Der Name des Use-­Cases wird dabei inner­- oder unterhalb der Ellipse notiert. "
        },
        {
            "term": "System",
            "synonym": "subject",
            "synonym1": "Systeme",
            "definition": "Das System ist diejenige Einheit, die das Verhalten, welches durch die Use-­Cases beschrie­ben wird, realisiert und anbietet. ",
            "definition1": "Das System wird als rechteckiger Kasten abgebildet, wobei die Kanten des Systems die Systemgrenzen darstellen. Der Name des Systems wird innerhalb des Kastens angegeben. "
        },
        {
            "term": "Akteur",
            "synonym": "actor",
            "synonym1": "Akteure",
            "definition": "Ein Akteur interagiert mit dem System, steht aber immer außerhalb davon. Beachte zudem, dass ein Akteur lediglich eine Rolle darstellt, die mit dem System interagiert. Ein Akteur muss nicht zwangsläufig eine natürliche Person sein, sondern kann auch ein Sensor, ein Zeitereignis oder ein anderes Gerät sein. ",
            "definition1": "Die gebräuchlichste Notation für einen Akteur ist das Strichmännchen, mit dem Namen des Akteurs oberhalb oder unterhalb. Vorgeschrieben ist nur, dass der Name in der Umgebung des Strichmännchens stehen muss. "
        },
        {
            "term": "Include Beziehung",
            "synonym": "include relationship",
            "synonym1": "include",
            "definition": "Die include-Beziehung wird durch eine unterbrochene gerichtete Kante mit dem Schlüs­selwort include dargestellt. ",
            "definition1": "Die include-Beziehung visualisiert, dass ein Use-­Case A, das Verhalten eines anderen Use­ Case B, importiert. "
        },
        {
            "term": "Extend Beziehung",
            "synonym": "extend relationship",
            "synonym1": "extend",
            "definition": "Die extend-Beziehung zeigt an, dass das Verhalten eines Use-Case, A durch einen anderen Use- Case, B erweitert werden kann, aber nicht muss. ",
            "definition1": "Eine extend-Beziehung ist eine unterbrochene gerichtete Kante mit der Bezeichnung extend vom erweiternden Use­-Case, zum erweiterten Use­-Case. Auch diese Beziehung ist ein Spezialfall der Abhängigkeitsbeziehung. "
        },
        {
            "term": "Erweiterungspunkt",
            "synonym": "extension point",
            "synonym1": "extend Punkt",
            "definition": "Die Stelle im Ablauf eines Use-­Cases, an dem das Verhalten erweitert werden kann, bezeich­net man als Erweiterungspunkt. Ein Use­-Case darf mehrere Erweite­rungspunkte besitzen. ",
            "definition1": ""
        },
        {
            "term": "Ereignis",
            "synonym": "event",
            "synonym1": "Ereignisse",
            "definition": "Übergänge von einem Zustand zum nächsten werden durch Ereignisse ausgelöst. Ein Ereignis ist ein zu beachtendes Vorkommnis, das in einem gegebenen Kontext eine Bedeutung hat, sich räumlich und zeitlich lokalisieren läßt, und das einen Zustandsübergang auslöst. ",
            "definition1": "Ereignisse werden durch Pfeile von einem Zustand zum nächsten notiert. Ein Pfeil kann auch auf den gleichen Zustand zurückführen. Auf den Pfeilen werden die Transitionsbeschreibungen aufgetragen. Ein Ereignis besteht aus einem Namen und einer Liste möglicher Argumente. "
        },
        {
            "term": "Zustand",
            "synonym": "state",
            "synonym1": "Zustände",
            "definition": "Ein Zustand gehört zu genau einer Klasse und stellt eine fachlich motivierte Abstraktion beziehungsweise Zusammenfassung einer Menge von möglichen Attributwerten dar, die die Objekte dieser Klasse einnehmen können. Jeder Zustand kann eine Menge von Zustandsvariablen enthalten. ",
            "definition1": "Zustände werden durch abgerundete Rechtecke dargestellt. Sie können einen Namen beinhalten und optional durch horizontale Linien in bis zu drei Bereiche geteilt werden. Im obersten Bereich steht der Name des Zustandes. Er kann weggelassen werden, es handelt sich in diesem Fall um einen anonymen Zustand. In einem weiteren Bereich können existierende Zustandsvariablen aufgelistet werden. Der dritte mögliche Bereich innerhalb des Zustandssymbols enthält eine Liste möglicher interner Ereignisse. "
        },
        {
            "term": "Zustandsübergang",
            "synonym": "state transition",
            "synonym1": "Zustandsübergänge",
            "definition": "Zustandsübergänge werden gewöhnlich durch Ereignisse ausgelöst, die auf den Pfeilen zwischen den Zuständen notiert werden. Übergänge ohne Ereignisbeschriftung werden automatisch ausgelöst, sobald die mit einem Zustand verbundenen Aktionen abgeschlossen sind. ",
            "definition1": "Beim Übergang von einem Zustand zum anderen wird einem Zielobjekt ein Ereignis gesendet. Auf diese Weise lassen sich Zustandsautomaten verschiedener Klassen miteinander verknüpfen. "
        },
        {
            "term": "Startzustand",
            "synonym": "initial pseudostate",
            "synonym1": "Start Zustand",
            "definition": "Der Startzustand ist ein besonderer Zustandstyp. Zu einem Startzustand kann kein Übergang stattfinden. Es gibt pro Diagramm immer nur einen Startzustand. ",
            "definition1": "Ein Startzustand wird als kleiner ausgefüllter Kreis gezeichnet. "
        },
        {
            "term": "Endzustand",
            "synonym": "terminate pseudostate",
            "synonym1": "End-Zustand",
            "definition": "Der Endzustand ist ein besonderer Zustandstyp. Von einem Endzustand führt kein Ereignis mehr weg. Ein Zustandsdiagramm kann mehrere Endzustände beinhalten. ",
            "definition1": "Die Endzustände werden jeweils durch einen nicht ausgefüllten Kreis, in dem ein kleinerer ausgefüllter Kreis liegt gezeichnet. "
        },
        {
            "term": "Aktivität",
            "synonym": "activity",
            "synonym1": "Aktivitäten",
            "definition": "Eine Aktivität ist ein einzelner Schritt in einem Verarbeitungsablauf. Sie ist ein Zustand mit einer internen Aktion und mindestens einer ausgehenden Transition. Die ausgehende Transition impliziert den Abschluss der internen Aktion. Eine Aktivität kann mehrere ausgehende Transitionen haben, wenn diese durch Bedingungen unterschieden werden können. Aktivitäten können Bestandteil von Zustandsdiagrammen sein, gewöhnlich werden sie jedoch in eigenen Aktivitätsdiagrammen verwendet. ",
            "definition1": "Dargestellt wird eine Aktivität durch ein grafisches Element mit gerader Ober- und Unterseite und konvex geformten Seiten. Dieses grafische Element enthält eine kurze Aktivitätsbeschreibung, die ein Name, eine frei formulierte Beschreibung, Pseudocode oder Programmiersprachencode sein kann. "
        },
        {
            "term": "Verantwortlichkeitsbereich",
            "synonym": "swim lanes",
            "synonym1": "Aktivitätsbereich",
            "definition": "Aktivitätsdiagramme können in Verantwortlichkeitsbereiche unterteilt werden, mit denen die Aktivitäten anderen Elementen oder Strukturen zugeordnet werden können. Beispielsweise lässt sich damit ausdrücken, zu welcher Klasse oder Komponente die Aktivitäten gehören. ",
            "definition1": "Verantwortlichkeitsbereiche werden dargestellt und abgeteilt durch senkrechte Linien, die aussehen wie Schwimmbahnen. In der UML-Spezifikation wird daher der Begriff swimlanes verwendet. "
        },
        {
            "term": "Kontrollknoten",
            "synonym": "control node",
            "synonym1": "Kontrolle Knoten",
            "definition": "Kontrollknoten werden bei der Spezifikation von Aktivitäten verwendet. Sie stellen spezielle Aktivitätsknoten dar, bei denen Objekt- und Kontrollflüsse koordiniert werden. Arten von Kontrollknoten sind: Startknoten, Endknoten, Parallelisierungsknoten, Synchronisationsknoten, Verzweigungsknoten sowie Verbindungsknoten. ",
            "definition1": "Kontrollknoten werden sehr verschieden gezeichnet. Nenne einen Kontrollknoten deiner Wahl. "
        },
        {
            "term": "Startknoten",
            "synonym": "initial node",
            "synonym1": "Start-Knoten",
            "definition": "Mit dem Startknoten startet der Ablauf der Aktivität. Jeder Startknoten darf beliebig viele weiterführende Kanten besitzen. Der Startknoten generiert einen Token und bietet diesen allen Kanten an. Dabei ist der Startknoten der einzige Knoten, der den generierten Token eine Zeit lang halten darf, falls nachfolgende Notationselemente ihn nicht sofort übernehmen können. Es gibt am Startknoten keine eingehende Kante. Ein Startknoten ist nicht zwingend. ",
            "definition1": "Ein Startknoten wird als kleiner ausgefüllter Kreis gezeichnet. "
        },
        {
            "term": "Endknoten",
            "synonym": "final node",
            "synonym1": "End-Knoten",
            "definition": "Ein Endknoten markiert das Ende eines Ablaufs. Es können beliebig viele Kanten in den Endknoten hineinlaufen, allerdings darf keine Kante weiterführen. ",
            "definition1": "Die Endknoten einer Aktivität werden jeweils durch einen nicht ausgefüllten Kreis, in dem ein kleinerer ausgefüllter Kreis liegt gezeichnet. Die Endknoten eines Kontrollflusses werden mit einem X im nicht ausgefüllten Kreis gezeichnet. "
        },
        {
            "term": "Parallelisierungsknoten",
            "synonym": "fork node",
            "synonym1": "Gabelungsknoten",
            "definition": "Der Gabelungsknoten teilt einen Kontrollfluss in mehrere parallele Kontrollflüsse auf. Im Unterschied zum Entscheidungsknoten wird hier nicht ein spezieller Weg gewählt, sondern alle Kontrollflüsse laufen gleichzeitig ab. Die einzelnen Abläufe werden parallel abgearbeitet. Diese Form nennt sich Multithreading. Notwendig ist dies bei Anwendungen, in denen mehrere Kontrollflüsse gleichzeitig ablaufen müssen. ",
            "definition1": "Bei der Parallelisierung oder Gabelung wird einem aus einer Aktivität ausgehenden Pfeil ein schwarzer Balken angefügt, der zur Verzweigung dient. Aus dem Balken folgen dann Pfeile zu mindestens 2 parallel auszuführenden Aktivitäten. "
        },
        {
            "term": "Synchronisationsknoten",
            "synonym": "merge node",
            "synonym1": "Zusammenführung",
            "definition": "Synchronisationsknoten können mehrere eingehende Kanten und nur eine ausgehende Kante besitzen. Es werden mehrere Kanten zu einer ausgehenden Kante zusammengeführt. Dabei wird nicht gewartet. ",
            "definition1": "Der Synchronisationsknoten wird wie der Entscheidungsknoten durch eine ausgefüllte Raute dargestellt. "
        },
        {
            "term": "Verzweigungsknoten",
            "synonym": "decision node",
            "synonym1": "Entscheidungsknoten",
            "definition": "Der Entscheidungsknoten, dargestellt durch eine ausgefüllte Raute, kann eine eingehende und mehrere ausgehende Kanten enthalten. Ein Token, der über die eingehende Kante ankommt und am Entscheidungsknoten eingeht, wird je nach Bedingung weitergeleitet. ",
            "definition1": "Der Entscheidungsknoten wird durch eine ausgefüllte Raute dargestellt. Die optionale Bedingung wird an der ausgehenden Kante ausgewertet. Dabei kann eine Entscheidung mit einem Kommentar noch näher beschrieben werden. "
        },
        {
            "term": "Verbindungsknoten",
            "synonym": "join node",
            "synonym1": "Vereinigung",
            "definition": "Die Vereinigung besagt genau das Gegenteil des Parallelisierungsknotens. Man spricht auch von der Und-Synchronisation. Dabei wird gewartet, bis alle Token der betroffenen Knoten angekommen sind. Eine Vereinigung besteht aus mehreren Kontrollflüssen, aus dem ein einziger Kontrollfluss wird. ",
            "definition1": "Bei der Vereinigung oder Verbindung wird den parallelisierten Aktivitäten ausgehenden Pfeilen ein schwarzer Balken angefügt, der zur Vereinigung dient. Aus dem Balken folgt dann ein Pfeil zu  genau einer auszuführenden Aktivitäten. "
        },
        {
            "term": "Token",
            "synonym": "token",
            "synonym1": "Tokens",
            "definition": "Unter einem Token versteht man in der U M L eine Marke, die einen Zeitpunkt darstellt, in dem sich der gesamte Ablauf gerade befindet. Der Token-Fluss bestimmt, dass der gesamte Ablauf einem bestimmten vorgegebenen Weg folgt, der durch die Kanten dargestellt wird. ",
            "definition1": "Es gibt kein Notationselement, das die Token in der U M L notiert, sondern kleine durchnummerierte Punkte, meist beginnend mit T 1. "
        },
        {
            "term": "Sequenz",
            "synonym": "sequence",
            "synonym1": "Sequenzen",
            "definition": "Eine Sequenz zeigt eine Reihe von Nachrichten, die eine ausgewählte Menge von Objekten in einer zeitlich begrenzten Situation austauscht, wobei der zeitliche Ablauf betont wird. ",
            "definition1": "In Sequenzdiagrammen werden Objekte durch gestrichelte senkrechte Linien dargestellt. Oberhalb der Linie steht der Name beziehungsweise das Objektsymbol. "
        },
        {
            "term": "Nachricht",
            "synonym": "message",
            "synonym1": "Nachrichten",
            "definition": "Nachrichten sind ein Mechanismus, mit dem Objekte untereinander kommunizieren können. Eine Nachricht überbringt einem Objekt die Information darüber, welche Aktivität von ihm erwartet wird. Das heißt eine Nachricht fordert ein Objekt zur Ausführung einer Operation auf. Die Beteiligten an einer Sequenz kommunizieren über Nachrichten. ",
            "definition1": "Die Nachrichten werden als waagrechte Pfeile zwischen den Objekt-Linien gezeichnet. Auf ihnen wird die Nachricht in der Form: Nachricht, Klammer auf: Argumente, Klammer zu, notiert. Ähnlich wie beim Kollaborationsdiagramm wird die Antwort in Textform oder als eigener, dann aber gestrichelter Pfeil mit offener Pfeilspitze dargestellt. "
        },
        {
            "term": "Synchrone Nachricht",
            "synonym": "synchronous message",
            "synonym1": "Synchrone Nachrichten",
            "definition": "Bei synchronen Nachrichten erfolgt ein normaler Nachrichtenaufruf und die Kontrolle wird an das gerufene Objekt übergeben. ",
            "definition1": "Synchrone Nachrichten werden mit einer gefüllten Pfeilspitze gezeichnet. "
        },
        {
            "term": "Asynchrone Nachricht",
            "synonym": "asynchronous message",
            "synonym1": "Asynchrone Nachrichten",
            "definition": "Asynchrone Aufrufe geben anders als der synchrone Aufruf sofort die Kontrolle an das rufende Objekt zurück. Asynchron bedeutet also, dass der Sender der Nachricht nicht auf eine Antwort wartet und nicht blockiert. ",
            "definition1": "Asynchrone Nachrichten werden mit einer offenen Pfeilspitze gezeichnet. "
        },
        {
            "term": "Lebenslinie",
            "synonym": "lifeline",
            "synonym1": "Lebenslinien",
            "definition": "Beim Sequenzdiagramm steht der zeitliche Verlauf der Nachrichten im Vordergrund. Die Objekte werden lediglich mit senkrechten Lebenslinien gezeigt. Der zeitliche Verlauf der Nachrichten wird dadurch hervorgehoben. Die Zeit verläuft dabei von oben nach unten. ",
            "definition1": "Die Überlagerung der gestrichelten Lebenslinien durch breite, nichtausgefüllte senkrechte Balken, symbolisiert den Steuerungsfokus. Der Steuerungsfokus gibt an, welches Objekt gerade die Programmkontrolle besitzt, das heißt welches Objekt gerade aktiv ist. "
        },
        {
            "term": "Sequenzausdruck",
            "synonym": "sequence expression",
            "synonym1": "Sequenznummer",
            "definition": "Die zeitliche Abfolge von Nachrichten wird in Kommunikationsdiagrammen mit Sequenzausdrücken modelliert. Jeder modellierten Nachricht ist ein Sequenzausdruck zugeordnet, aus dem hervorgeht, was die Vorgängernachrichten sind und welche Nachrichten allenfalls parallel ablaufen. ",
            "definition1": "Ein Sequenzausdruck besteht aus einer Folge von mit einem Punkt getrennten Sequenztermen, gefolgt von einem Doppelpunkt. "
        },
        {
            "term": "Sequenzterm",
            "synonym": "sequence term",
            "synonym1": "Sequenzterme",
            "definition": "Sequenzterme sind Zahlen, zum Beispiel 1, 10 oder 22, die optional von einem Kleinbuchstaben, zum Beispiel A, oder B, gefolgt werden. ",
            "definition1": "Folgende Zeichenfolgen sind also gültige Sequenzausdrücke: Eins. 1.7, 1 A .6, 1 A .6 C .2."
        },
        {
            "term": "Requirements Engineering",
            "synonym": "R E",
            "synonym1": "Anforderungsanalyse",
            "definition": "Requirements Engineering ist der Prozess des Herausfindens, Analysierens, Dokumentierens und Überprüfens der Dienste und Beschränkungen eines zu erstellenden Systems. ",
            "definition1": "Das Requirements Engineering ist ein kooperativer, iterativer und inkrementeller Prozess. Er gewährleistet, dass alle relevanten Anforderungen bekannt sind und Stakeholdern eingebunden werden. "
        },
        {
            "term": "Objektorientiere Analyse",
            "synonym": "O O A",
            "synonym1": "object-oriented analysis",
            "definition": "Die objektorientierte Analyse beinhaltet die Ermittlung und Beschreibung der Anforderungen an ein Software System mittels objektorientierter Konzepte und Notationen. Das Ergebnis ist ein O O A Modell. ",
            "definition1": "Aus der objektorientierten Analyse folgt das Produktmodell. "
        },
        {
            "term": "Designphase",
            "synonym": "Entwurfsprozess",
            "synonym1": "Entwurf",
            "definition": "Nach der Analyse und Modellierung der in Software abzubildenden Prozesse werden vor der eigentlichen Implementierung weitere vorbereitende Schritte unternommen, um eine passende Software zu erstellen. ",
            "definition1": "Das Softwaredesign kann in die Bereiche Grobentwurf und Feinentwurf aufgeteilt werden. Der Entwurfsprozess generiert in mehreren Teilschritten die softwaretechnische Lösung im Sinne einer Softwarearchitektur. "
        },
        {
            "term": "Software Engineering",
            "synonym": "S E",
            "synonym1": "Softwaretechnik",
            "definition": "Software Engineering zielt auf die ingenieurmäßige Entwicklung, Anpassung und Weiterentwicklung großer Softwaresysteme unter Verwendung bewährter systematischer Vorgehensweisen, Prinzipien, Methoden und Werkzeuge. ",
            "definition1": "Software Engineering ist die zielorientierte Bereitstellung und systematische Verwendung von Prinzipien, Methoden und Werkzeugen für die arbeitsteilige, ingenieurmäßige Entwicklung und Anwendung von umfangreichen Softwaresystemen. "
        },
        {
            "term": "Softwarearchitektur",
            "synonym": "S A",
            "synonym1": "software architecture",
            "definition": "Die Softwarearchitektur eines Programms oder eines Computersystems ist die Struktur oder sind die Strukturen des Systems, die die Softwareelemente, die extern sichtbaren Eigenschaften dieser Elemente und die Verbindung zwischen diesen Elementen umfasst. ",
            "definition1": "Eine Softwarearchitektur beschreibt die Strukturen eines Softwaresystems durch Architekturbausteine und ihre Beziehungen und Interaktionen untereinander sowie ihre physikalische Verteilung. Die extern sichtbaren Eigenschaften eines Architekturbausteins werden durch Schnittstellen spezifiziert. "
        },
        {
            "term": "Feindesign",
            "synonym": "",
            "synonym1": "",
            "definition": "Im Prozess des Feindesign wird eine Verknüpfung der logischen Architektur mit den softwaretechnischen Infrastrukturen definiert. ",
            "definition1": "Für das Feindesign müssen die vier Sichten Kontext, Statik, Laufzeit und Verteilung modelliert werden. Entwurfspattern spielen hier eine große Rolle. "
        },
        {
            "term": "Grobdesign",
            "synonym": "",
            "synonym1": "",
            "definition": "Der Grobentwurf dient als Basis für die Auslegung der softwaretechnischen Infrastruktur, weil sich mit dessen Hilfe die erforderten Infrastrukturkomponenten identifizieren lassen. Basis für die Architektur im Großen sind Architekturmuster. ",
            "definition1": "Architekturmuster beschreiben Systemstrukturen, die die Gesamtarchitektur eines Systems festlegen. Sie spezifizieren, wie Subsysteme zusammenarbeiten. "
        },
        {
            "term": "Anforderung",
            "synonym": "Anforderungen",
            "synonym1": "requirements",
            "definition": "Eine Anforderung ist eine übermittelte Eigenschaft oder Fähigkeit, die zur Lösung eines Problems oder zur Erreichung eines Ziels benötigt wird und gegebenenfalls aufgrund eines formellen Dokuments erfüllt werden muss. ",
            "definition1": ""
        },
        {
            "term": "Qualitätsanforderung",
            "synonym": "Qualitätsanforderungen",
            "synonym1": "nicht funktionale Anforderungen",
            "definition": "Qualitätsanforderungen sind Aspekte, die typischerweise mehrere oder alle funktionalen Anforderungen betreffen beziehungsweise überschneiden. ",
            "definition1": "Eine Qualitätsanforderung legt eine qualitative und oder quantitative Eigenschaft des Softwaresystems oder einer seiner Komponenten fest. "
        },
        {
            "term": "funktionale Anforderung",
            "synonym": "funktionale Anforderungen",
            "synonym1": "functional requirements",
            "definition": "Die funktionalen Anforderungen können umschrieben werden als die Kernaufgaben, die ein System erfüllen muss. ",
            "definition1": "Die funktionale Anforderung wird definiert als die Festlegung einer vom Softwaresystem oder einer seiner Komponenten bereitzustellende Funktion oder bereitzustellenden Service. "
        },
        {
            "term": "Stakeholder",
            "synonym": "",
            "synonym1": "",
            "definition": "Ein Stakeholder ist ein Individuum, eine Gruppe von Personen oder eine Organisation, die ein indirektes oder direktes Interesse an einem System und somit Einfluss auf die Ziele, Anforderungen und Randbedingungen des betrachteten Systems haben. ",
            "definition1": ""
        },
        {
            "term": "Systemziel",
            "synonym": "Ziele",
            "synonym1": "Ziel",
            "definition": "Ausgehend von einer Vision dienen Ziele dazu, die Vision zu verfeinern und zu operationalisieren. ",
            "definition1": "Ziele sind die intentionale Beschreibung eines von Stakeholdern gewünschten charakteristischen Merkmals des zu entwickelnden Systems beziehungsweise des zugehörigen Entwicklungsprojekts. "
        },
        {
            "term": "Produktvision",
            "synonym": "Vision",
            "synonym1": "",
            "definition": "Eine Vision ist eine realitätsnahe Vorstellung der gewünschten Zukunft. Sie beschreibt, was erreicht werden soll, sagt aber nicht wie. ",
            "definition1": "Eine Vision dient als Leitgedanke für alle Stakeholder. "
        },
        {
            "term": "Rahmenbedingungen",
            "synonym": "Rahmenbedingung",
            "synonym1": "conditions",
            "definition": "Eine Rahmenbedingung legt organisatorische und oder technische Restriktionen für das Softwaresystem und oder den Entwicklungsprozess fest. ",
            "definition1": "In der Literatur wird zwischen technischen und organisatorischen Randbedingungen beziehungsweise Rahmenbedingungen und Konventionen abgegrenzt, wobei die Begrifflichkeiten nicht konsistent verwendet werden. "
        },
        {
            "term": "Kontextabgrenzung",
            "synonym": "Abgrenzung",
            "synonym1": "context boundaries",
            "definition": "Im Rahmen der Systemanalyse muss die Umgebung und der genaue Umfang des Systems definiert werden. Dafür werden die Systemgrenze und die Kontextgrenze gezogen. ",
            "definition1": ""
        },
        {
            "term": "Systemgrenze",
            "synonym": "system boundaries",
            "synonym1": "Systemgrenzen",
            "definition": "Die Systemgrenze zieht einen Strich zwischen dem System und dessen Umgebung. Das System kann Teile außerhalb dieser Grenze nicht durch den Entwicklungsprozess verändern. ",
            "definition1": ""
        },
        {
            "term": "Kontextgrenze",
            "synonym": "context borderline",
            "synonym1": "",
            "definition": "Die Kontextgrenze trennt den relevanten Teil eines geplanten Systems vom irrelevanten Teil, das heißt dem Teil der Umgebung, der keinen Einfluss auf das geplante System und dessen Anforderungen hat. ",
            "definition1": ""
        },
        {
            "term": "Kontext",
            "synonym": "Systemkontext",
            "synonym1": "context",
            "definition": "Der Systemkontext befindet sich zwischen Systemgrenze und Kontextgrenze. Er unmfasst alle Aspekte, die für die Anforderungen des geplanten Systems relevant sind, und die nicht im Rahmen der Entwicklung dieses Systems gestaltet werden können. ",
            "definition1": "Der Systemkontext, auch Systemumfang genannt, besteht aus allen materiellen und immateriellen Objekten, die eine Beziehung zu dem System haben. "
        },
        {
            "term": "Schleife",
            "synonym": "loop",
            "synonym1": "Wiederholung",
            "definition": "Eine Schleife ist eine Kontrollstruktur in Programmiersprachen. Sie wiederholt einen Anweisungs-Block – den sogenannten Schleifenrumpf oder Schleifenkörper – solange die Schleifenbedingung als Laufbedingung gültig bleibt beziehungsweise als Abbruchbedingung nicht eintritt. Schleifen, deren Schleifenbedingung immer zur Fortsetzung führt oder die keine Schleifenbedingung haben, sind Endlosschleifen. ",
            "definition1": "Es gibt verschiedene Arten von Schleifen: die vorprüfende oder kopfgesteuerete Schleife, die nachprüfende oder fußgesteuerte Schleife, die Zählschleife, die Mengenschleife, Schleifen mit Laufbedingung sowie Schleifen mit Abbruchbedingung. "
        },
        {
            "term": "Verzweigung",
            "synonym": "decision",
            "synonym1": "Verzweigungen",
            "definition": "Bedingte Anweisungen und Verzweigungen bilden, zusammen mit den Schleifen, die Kontrollstrukturen der Programmiersprachen. Sie gehören zu den wichtigsten Bestandteilen der Programmierung, da durch sie ein Programm auf unterschiedliche Zustände und Eingaben reagieren kann. ",
            "definition1": "Eine Verzweigung legt fest, welcher von zwei oder mehr Programmabschnitten, abhängig von einer oder mehreren Bedingungen, ausgeführt wird. "
        }

    ]
}